mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xl/common/mb9bf16xl.h
#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P0                        *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P1                        *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P2                        *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P3                        *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P4                        *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P5                        *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile  uint8_t *)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P6                        *((volatile  uint8_t *)(0x42DE6298UL))
#define bFM_GPIO_PDIR5_P7                         *((volatile  uint8_t *)(0x42DE629CUL))
#define bFM4_GPIO_PDIR5_P7                        *((volatile  uint8_t *)(0x42DE629CUL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P0                        *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P1                        *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P2                        *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P3                        *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM_GPIO_PDIR6_P4                         *((volatile  uint8_t *)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P4                        *((volatile  uint8_t *)(0x42DE6310UL))
#define bFM_GPIO_PDIR6_P5                         *((volatile  uint8_t *)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P5                        *((volatile  uint8_t *)(0x42DE6314UL))
#define bFM_GPIO_PDIR6_P6                         *((volatile  uint8_t *)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P6                        *((volatile  uint8_t *)(0x42DE6318UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P0                        *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM4_GPIO_PDIR8_P1                        *((volatile  uint8_t *)(0x42DE6404UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P0                        *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P2                        *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x42DE670CUL))
#define bFM4_GPIO_PDIRE_P3                        *((volatile  uint8_t *)(0x42DE670CUL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P0                        *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P1                        *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P2                        *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P3                        *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P4                        *((volatile  uint8_t *)(0x42DE8010UL))

#define bFM_GPIO_PDOR1_P0                         *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P0                        *((volatile  uint8_t *)(0x42DE8080UL))
#define bFM_GPIO_PDOR1_P1                         *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P1                        *((volatile  uint8_t *)(0x42DE8084UL))
#define bFM_GPIO_PDOR1_P2                         *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P2                        *((volatile  uint8_t *)(0x42DE8088UL))
#define bFM_GPIO_PDOR1_P3                         *((volatile  uint8_t *)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P3                        *((volatile  uint8_t *)(0x42DE808CUL))

#define bFM_GPIO_PDOR2_P0                         *((volatile  uint8_t *)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P0                        *((volatile  uint8_t *)(0x42DE8100UL))
#define bFM_GPIO_PDOR2_P1                         *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P1                        *((volatile  uint8_t *)(0x42DE8104UL))
#define bFM_GPIO_PDOR2_P2                         *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P2                        *((volatile  uint8_t *)(0x42DE8108UL))
#define bFM_GPIO_PDOR2_P3                         *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P3                        *((volatile  uint8_t *)(0x42DE810CUL))
#define bFM_GPIO_PDOR2_P4                         *((volatile  uint8_t *)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P4                        *((volatile  uint8_t *)(0x42DE8110UL))
#define bFM_GPIO_PDOR2_P5                         *((volatile  uint8_t *)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P5                        *((volatile  uint8_t *)(0x42DE8114UL))
#define bFM_GPIO_PDOR2_P6                         *((volatile  uint8_t *)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P6                        *((volatile  uint8_t *)(0x42DE8118UL))

#define bFM_GPIO_PDOR3_P0                         *((volatile  uint8_t *)(0x42DE8180UL))
#define bFM4_GPIO_PDOR3_P0                        *((volatile  uint8_t *)(0x42DE8180UL))
#define bFM_GPIO_PDOR3_P1                         *((volatile  uint8_t *)(0x42DE8184UL))
#define bFM4_GPIO_PDOR3_P1                        *((volatile  uint8_t *)(0x42DE8184UL))
#define bFM_GPIO_PDOR3_P2                         *((volatile  uint8_t *)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P2                        *((volatile  uint8_t *)(0x42DE8188UL))
#define bFM_GPIO_PDOR3_P3                         *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P3                        *((volatile  uint8_t *)(0x42DE818CUL))
#define bFM_GPIO_PDOR3_P4                         *((volatile  uint8_t *)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P4                        *((volatile  uint8_t *)(0x42DE8190UL))
#define bFM_GPIO_PDOR3_P5                         *((volatile  uint8_t *)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P5                        *((volatile  uint8_t *)(0x42DE8194UL))

